Revit 2026 API

# ValueAtPoint Properties

---

The ValueAtPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ValueAtPointBase) |

#### Reference

ValueAtPoint Class

Autodesk.Revit.DB.Analysis Namespace